clear
clc
% %%%%%%%%%%%%%%%%%%%%%%   Hermite插值命令
% x=[1,2];
% y=[0,0.693147];
% dy=[1,0.5];
% xk=1.5;
% H3=Hermite3(x,y,dy,xk);
%%%%%%%%%%%%%%%%%%%%%%%    拉格朗日插值命令
% x=[0.4 0.5 0.7 0.8];
% y=[-0.916291 -0.693147 -0.356675 -0.223144];
% xk=0.6;
% L= LagrangeInsertValue(x,y,xk)
%%%%%%%%%%%%%%%%%%%%%%%%%   均差的牛顿插值法
% x=[2.0 2.1 2.2];
% y=[1.414214 1.449138 1.483240];
% xk=2.15;
% f= NewtonInsertValue(x,y,xk)
%%%%%%%%%%%%%%%%%%      牛顿向前插值公式
x=1.00:0.05:1.30;
y=sqrt(x);
xk=1.01;
f0=NewtonInsertValueForward(x,y,xk)
%%%%%%%%%%%%%%%%%%  牛顿向后插值公式
x1=1.00:0.05:1.30;
y1=sqrt(x);
xk1=1.28;
f1=NewtonInsertValueBack(x1,y1,xk1)
